import pandas as pd
import pytest

from src.views import cards_collector, top_transactions


@pytest.mark.parametrize(
    "value, expected",
    [
        (
            [
                {"Номер карты": "*1234", "Сумма операции": "-500", "Кэшбэк": 70},
                {"Номер карты": "*5533", "Сумма операции": "500"},
                {"Номер карты": "*1234", "Сумма операции": "-100", "Кэшбэк": 20},
                {"Номер карты": "*5533", "Сумма операции": "720", "Кэшбэк": 10},
                {"Номер карты": "*6251", "Сумма операции": "-700", "Кэшбэк": 150},
                {"Номер карты": "*1234", "Сумма операции": " 200", "Кэшбэк": 70},
                {"Номер карты": "*6251", "Сумма операции": "-1000"},
                {"Номер карты": "*1234", "Сумма операции": "-30", "Кэшбэк": 70},
            ],
            [
                {"last_digits": "1234", "total_spent": 830.0, "cashback": 2},
                {"last_digits": "5533", "total_spent": 1220.0, "cashback": 0},
                {"last_digits": "6251", "total_spent": 1700.0, "cashback": 1},
            ],
        )
    ],
)
def test_cards_collector(value: list, expected: list) -> None:
    assert cards_collector(pd.DataFrame(value)) == expected


@pytest.mark.parametrize("value, expected",
                         [
                             (
                                 [
                                     {
                                         "Дата операции": "01.02.2020 15:02:12",
                                         "Сумма операции": "-500",
                                         "Категория": "Переводы",
                                         "Описание": "Дмитрий Ш.",
                                     },
                                     {
                                         "Дата операции": "01.01.2019 15:02:12",
                                         "Сумма операции": "500",
                                         "Категория": "Переводы",
                                         "Описание": "Василий П.",
                                     },
                                     {
                                         "Дата операции": "21.12.2024 15:02:12",
                                         "Сумма операции": "-1500",
                                         "Категория": "Супермаркеты",
                                         "Описание": "Пятерочка",
                                     },
                                     {
                                         "Дата операции": "21.12.2020 15:02:12",
                                         "Сумма операции": "-500",
                                         "Категория": "Фастфуд",
                                         "Описание": "Вкусно и точка",
                                     },
                                     {
                                         "Дата операции": "21.12.2024 15:02:12",
                                         "Сумма операции": "-500",
                                         "Категория": "Развлечения",
                                         "Описание": "Steam",
                                     },
                                     {
                                         "Дата операции": "10.03.2022 15:02:12",
                                         "Сумма операции": "-2500",
                                         "Категория": "Заправки",
                                         "Описание": "Роснефть №152",
                                     },
                                     {
                                         "Дата операции": "24.02.2022 15:02:12",
                                         "Сумма операции": "-500",
                                         "Категория": "Переводы",
                                         "Описание": "Ирина Л.",
                                     },
                                     {
                                         "Дата операции": "25.02.2024 15:02:12",
                                         "Сумма операции": "600",
                                         "Категория": "Переводы",
                                         "Описание": "Петр Р.",
                                     },
                                 ],
                                 [
                                     {"amount": "600", "category": "Переводы", "date": "25.02.2024",
                                      "description": "Петр Р."},
                                     {"amount": "500", "category": "Переводы", "date": "01.01.2019",
                                      "description": "Василий П."},
                                     {"amount": "-500", "category": "Развлечения", "date": "21.12.2024",
                                      "description": "Steam"},
                                     {"amount": "-500", "category": "Переводы", "date": "24.02.2022",
                                      "description": "Ирина Л."},
                                     {"amount": "-500", "category": "Фастфуд", "date": "21.12.2020",
                                      "description": "Вкусно и точка"},
                                 ],
                             )
                         ],
                         )
def test_top_transactions(value: list, expected: list) -> None:
    assert top_transactions(pd.DataFrame(value)) == expected
